package andoop.android.amstory.data;

import android.content.Context;

/**
 * Created by domob on 2017/2/15.
 */

public class JsonReportory {
    private Context context;
    private static JsonReportory INSTANCE;

    private JsonReportory(Context context) {
        this.context = context;
    }

    public static JsonReportory newInstance(Context context) {

        if (INSTANCE == null) {
            synchronized (JsonReportory.class) {
                if (INSTANCE == null) {
                    INSTANCE = new JsonReportory(context);
                }
            }

        }
        return INSTANCE;
    }
    public String getStory(String type, int page){

        return "{\n" +
                "    \"data\": {\n" +
                "        \"storys\": [\n" +
                "            {\n" +
                "                \"author\": \"\",\n" +
                "                \"content\": \"天天刷牙习惯好&&&今天的午饭真丰盛，有花生、瓜子、薯片，&&&还有蜂蜜等许许多多好吃的食物。&&&小熊可高兴了，吃了这样吃那样，&&&把小肚子都撑得圆滚滚的。&&&吃饱后，小熊满足地说：&&& “妈妈，我吃饱了，我要去玩了。”&&& “等等，先漱漱口再去吧！” &&&妈妈提醒说。&&&小熊没听到，一溜烟就不见了。&&&小熊并不知道，&&&在自己的嘴巴里、牙齿上、牙缝（fènɡ）里&&&还遗留着许多食物残渣。&&&食物残渣散发出阵阵香味，引来许多牙菌。&&& “这里的食物真好吃！”&&& “这里是快乐的家园！”&&& “我要把家安在这里！”&&&牙菌们欢快地叫喊着，&&&在小熊的嘴巴里安了家。&&&到后来，小熊的整张嘴巴都快被牙菌占领了。&&&可小熊只顾着玩，&&&根本不知道嘴巴里发生的事情。&&&到了晚上，小熊回到家里。&&&这时他才觉得嘴巴里酸酸臭臭的，有点难受。&&& “张开嘴让妈妈看看！”妈妈说。&&& “啊——”&&&小熊一张嘴，就涌出一股臭味，&&&差点把妈妈熏倒了。&&&妈妈屏着气，&&&认真地检查起小熊的嘴巴。&&&她发现小熊的牙齿有点黄，&&&牙缝里还塞着许多污垢，&&&就赶紧说：“是牙菌在作怪。&&&你呀，快去刷牙，把它们赶走！”&&&小熊连忙来到卫生间刷牙。&&&他先在牙刷上抹上牙膏，&&&然后把牙刷伸进嘴巴里，&&&刷了起来。&&& “不好，小主人在刷牙了。&&&我们快躲起来。” &&&牙菌们吓坏了，&&&连滚带爬地躲到牙齿的后面和牙缝里。&&&小熊才不会放过它们呢。&&&他举着牙刷上上下下、&&&左左右右、&&&里里外外&&&把两排牙齿上的牙菌全刷了个遍。&&& “这下惨了……”&&&牙菌们再也神气不起来了，&&&接二连三地滚到口腔里。&&& “咕噜噜……”小熊含了一口水漱起口来。“&&&噗——”嘴巴里的许多牙菌连同水一起被吐了出来。&&&小熊知道嘴巴还有不少牙菌，&&&就举着牙刷又仔细地刷了一遍，&&&再漱口，这样重复了几遍，&&&直到嘴巴里的牙菌全被赶走为止。&&& “哈——”小熊轻轻哈了一口气。&&& “嗯，真香！”妈妈表扬道。&&& “嘻嘻！”小熊重新欢快起来，&&& “我以后每天都要坚持漱口、刷牙！”\",\n" +
                "                \"id\": \"\",\n" +
                "                \"img\": \"file:///android_asset/story_icons/mutouren.png\",\n" +
                "                \"title\": \"天天刷牙好习惯\",\n" +
                "                \"voice\": \"\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"author\": \"\",\n" +
                "                \"content\": \"木匠和木头的故事：会说话的木头&&&木匠师傅得到了一根奇怪的木头：&&&像孩子一样，既会哭又会笑。&&&他是怎样得到的呢？&&&在古老的时候，有……&&& “是不是有一个国王？”小朋友们立即问道。&&&小朋友们，你们说错了。&&&在古老的时候，不是有一位国王，&&&也不是有一位王子或公主，而是有一根木头。&&&它是一根非常普通的木头，&&&是用来烧火的杂木。&&&在寒冷的冬天里，&&&人们为了取暖，&&&通常要在房屋里生炉子，&&&炉子里边烧的一般就是这种木头。&&&正是因为这根木头，&&&我们才有了下面这一个曲折、生动、有趣的故事。&&&在一个晴朗的日子里，&&&不知是什么原因，&&&一根木头“啪”地一声，&&&刚好落进一位老木匠的店铺里边。&&&那位老木匠的名字叫安东尼奥，&&&年龄大约有六十岁，&&&因为他的鼻尖老是紫红紫红的，&&&并且闪闪发亮，&&&好像是一颗熟透了的红樱桃。&&&所以，人们给他起了一个绰号&&&称他为“樱桃师傅”。&&&樱桃师傅正在店铺里面干活，&&&忽然听到“啪”的一声。&&&开始时吓了一大跳，&&&但当他发现是一根木头掉进来以后，又非常激动。&&&他兴奋得像孩子一样，&&&眉开眼笑，搓着双手&&&小声嘀咕着：&&& “这木头是从哪儿来的呢？&&&管他呢，我正准备做一条桌腿&&&这次可得到一根合适的木头。”&&&樱桃师傅马上提起一把非常锋利的斧子&&&准备把木头外面的那层皮削去，&&&先做出一个桌子腿的形状。&&&当樱桃师傅举起斧子正要砍下的时候，&&&突然耳边听到一个极为细小的声音，&&&央求着说：&&& “喂！请你手下留情，&&&砍轻一点儿！我怕疼啊！”&&&心地善良的樱桃师傅听到后大吃一惊，&&&举在半空中的斧子也停了下来。&&& “什么人？是谁在跟我说话呢？”&&&他睁大眼睛，在屋里四处搜寻，&&&可是连个人影儿也没有。&&&樱桃师傅心中非常纳闷：&&&这是谁的声音呢？&&&这个声音怎么这样陌生？&&&随后，他又趴到工作台下，&&&打开放衣服的柜门，&&&揭起装锯末和刨花儿的箱盖……&&&没有，根本就没人。&&&最后，他干脆开门出去，&&&向街上望去，&&&还是没发现一个人。&&&可是，这声音究竟是从哪儿传来的呢？&&& “我知道了！” &&&樱桃师傅搔搔假发，&&&笑着自言自语地说道：&&& “唉，上了年纪的人了，耳朵不好使了，&&&肯定是自个儿的幻觉，接着再来吧。”&&&樱桃师傅这样想，&&&心中松了一口气，&&&又举起斧头，大吼了一声，&&&再次用力向那根木头砍下去。&&& “哎哟，天哪！疼死我了，&&&你就不能轻一点吗？你砍伤我了！”&&&樱桃师傅一面哼着歌，&&&一面将斧子丢到一旁，&&&又从工具箱里面找出一把刨子。&&&这一次他准备将那根木头弄得光溜溜的。&&&樱桃师傅把那根木头固定在工作台上，&&& “呼哧呼哧”地来回推动着刨子。&&&没推几下，那细小的声音又传入耳中，&&&只听那声音“咯咯咯咯”地笑着说：&&& “不要刨了，&&&停下来，快停下来吧，&&&你把我弄得痒死啦！”&&&不幸的是樱桃师傅听到这声音后，&&&身体就像突然被强烈的电流击中一样，&&&一下子仰面跌倒在地。&&&当他慢慢醒过来的时候，&&&发现自己躺在了地板上。&&&老木匠的脸完全变了色，&&&因为非常恐惧，&&&就连原来总是红得发紫的鼻尖，这会儿也变成了青白色。\",\n" +
                "                \"id\": \"\",\n" +
                "                \"img\": \"file:///android_asset/story_icons/shuaya.png\",\n" +
                "                \"title\": \"木匠和木头的故事\",\n" +
                "                \"voice\": \"\"\n" +
                "            }\n" +
                "        ],\n" +
                "        \"type\": 1\n" +
                "    },\n" +
                "    \"error\": {\n" +
                "        \"code\": 200,\n" +
                "        \"msg\": \"\"\n" +
                "    }\n" +
                "}";
    }

    public String getBanner(){

        return "{\n" +
                "    \"data\": {\n" +
                "        \"banner\": [\n" +
                "            {\n" +
                "                \"desc\": \"banner01\",\n" +
                "                \"img\": \"file:///android_asset/banner_icons/banner01.jpg\",\n" +
                "                \"url\": \"http://news.dahe.cn/2017/02-16/108287701.html\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"desc\": \"banner02\",\n" +
                "                \"img\": \"file:///android_asset/banner_icons/banner02.jpg\",\n" +
                "                \"url\": \"http://chanye.07073.com/guonei/1553341.html\"\n" +
                "            },\n" +
                "            {\n" +
                "                \"desc\": \"banner03\",\n" +
                "                \"img\": \"file:///android_asset/banner_icons/banner03.jpg\",\n" +
                "                \"url\": \"http://games.enet.com.cn/a/2017/0216/A2017021600604712_0.shtml\"\n" +
                "            }\n" +
                "        ]\n" +
                "    },\n" +
                "    \"error\": {\n" +
                "        \"code\": 200,\n" +
                "        \"msg\": \"\"\n" +
                "    }\n" +
                "}";
    }

}
